run/tutorials/coflowFlame.ethylene.F3A/constant/solverOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      binary;
    class       dictionary;
    location    "constant";
    object      flameletsProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	//- Path to flamelet library
	libraryPath	"../libraries/library.C2H4/OutputXML";

	//- Minimum value of scalar dissipation rate [Hz]
	chiMinimum      1e-5;	

	//- Uniform value of scalar dissipation rate (only for starting simulations)
	chiUniform 	false;

// ************************************************************************* //

